// Задание 1
// for (let rait = 1; rait <= 2; rait++){
//     console.log('Привет');
// }

// Задание 2___________________________________
// for (let chislo = 1; chislo <= 5; chislo++){
//     console.log(`${chislo}`);
// }

// Задание 3_____________________________________
// for (let rty = 7; rty <= 22; rty++){
//     console.log(`${rty}`);
// }

// Задание 4______________________________________
// const obj={
//     ['Коля']: '200',
//     ['Вася']: '300',
//     ['Петя']: '400'
// }
// for (let r in obj){
//     console.log(`${r}, зарплата ${obj[r]} долларов.`);
// }

// Задание 5_______________________________________
// for_____________________
// for (let num = 0, n = 1000; num < n; num++){
//     if (n < 50){
//         console.log(`Количество потребовавшихся итераций ${num}`);
//         break;
//     }
//     n = n/2;
//     }

// while_________________
// let num = 0;
// let n = 1000;
// while (num < n){
//     if (n < 50){
//         console.log(`Количество потребовавшихся итераций ${num}`);
//         break;
//     }
//     n = n/2;
//     num ++;
// }

// Задание 6____________________________

for (let den = 31, i = 1, ryu = 12; i<=den; i++){
    if (i >= 31){
        
        break;
    } 
    if (i == 5){
        console.log(`Сегодня пятница, ${i} число, пора делать отчёт.`);
    }

    if (i == ryu){
        console.log(`Сегодня пятница, ${i} число, пора делать отчёт.`);
        ryu = ryu + 7;
    }
}